; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	infrared2 - mode
	spectrograph1 - mode
	image3 - mode
	thermograph0 - mode
	Star1 - direction
	Star3 - direction
	GroundStation0 - direction
	Star4 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument4 image3)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite1 Planet10)
	(have_image Phenomenon5 spectrograph1)
	(have_image Planet6 image3)
	(have_image Star7 spectrograph1)
	(have_image Planet8 image3)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 thermograph0)
	(have_image Phenomenon11 image3)
))

)

; plan
1. (turn_to satellite2 star2 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 star2)
   goals met: 0 of 9
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite2 phenomenon11 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon11)
   goals met: 0 of 9
5. (turn_to satellite1 star4 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star4)
   goals met: 0 of 9
6. (turn_to satellite0 star7 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star7)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon11 instrument4 image3)
   added: (have_image phenomenon11 image3)
   goals met: 2 of 9
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 9
9. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 2 of 9
10. (turn_to satellite1 phenomenon5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 9
11. (take_image satellite1 phenomenon5 instrument2 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 3 of 9
12. (turn_to satellite1 phenomenon9 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 9
13. (take_image satellite1 phenomenon9 instrument2 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 9
14. (turn_to satellite1 star7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star7)
   goals met: 4 of 9
15. (take_image satellite1 star7 instrument2 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 5 of 9
16. (turn_to satellite1 planet10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet10)
   goals met: 6 of 9
17. (take_image satellite1 planet10 instrument2 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 7 of 9
18. (turn_to satellite2 planet6 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet6)
   goals met: 7 of 9
19. (take_image satellite2 planet6 instrument4 image3)
   added: (have_image planet6 image3)
   goals met: 8 of 9
20. (turn_to satellite2 planet8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 planet8)
   goals met: 8 of 9
21. (take_image satellite2 planet8 instrument4 image3)
   added: (have_image planet8 image3)
   goals met: 9 of 9
